module Pred where

open import lib

------------------------------------------------------------------------------
-- Forall
------------------------------------------------------------------------------

-- ∀(x : M) → P x   -- \forall

--     x : M ⊢ p : P x                  f : ∀(x : M) → P x      m : M
-- ------------------------intro        -----------------------------elim
-- λ x → p : ∀(x : M) → P x                       f m : P m

l1 : (∀(x : M) → P x ∧ Q x) ↔ (∀(x : M) → P x) ∧ (∀(x : M) → Q x)
l1 = (λ a → (λ x → proj₁ (a x)) , (λ x → proj₂ (a x))) , (λ b → λ x → proj₁ b x  , proj₂ b x)

l2 : ¬ ¬ (∀(x : M) → P x) → ∀(x : M) → ¬ ¬ (P x)
l2 = λ a → λ x → λ np → np (abort (P x) (a (λ b → np (b x))))

------------------------------------------------------------------------------
-- Exists
------------------------------------------------------------------------------

-- ∃ M (λ x → P x)   -- \exists

-- m : M        p : P m           w : ∃ M λ x → P x        w : ∃ M λ x → P x
-- -----------------------intro   -----------------elim1  ---------------------elim2  
-- (m , p) : ∃ M λ x → P x          proj₁ w : M           proj₂ w : P (proj₁ m)           


l3 : (∃ M λ x → ¬ P x) → ¬ (∀(x : M) → P x)
l3 = {!!}

l4 : (¬ ∃ M λ x → P x) → ∀(x : M) → ¬ P x
l4 = {!!}

l5 : (∀(x : M) → ¬ P x) → ¬ ∃ M λ x → P x
l5 = {!!}

l6 : (∃ M λ x → ∀(y : N) → R x y) → ∀(y : N) → ∃ M λ x → R x y
l6 = {!!}

-- axiom of choice

AC : (∀(x : M) → ∃ N λ y → R x y) → ∃ (M → N) λ f → ∀(x : M) → R x (f x)
AC = {!!}
